Import the required Python libraries

In [26]:


import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

dataset

In [47]:
dataset = pd.read_csv('Data/Employee_Salaries_-_2020.csv')
dataset

,Department,Department Name,Division,Gender,Base Salary,2020 Overtime Pay,2020 Longevity Pay,Grade
0,ABS,Alcohol Beverage Services,Wholesale Administration,F,78902.00,199.17,0.00,18
1,ABS,Alcohol Beverage Services,Administrative Services,F,35926.00,0.00,4038.91,16
2,ABS,Alcohol Beverage Services,Administration,M,167345.00,0.00,0.00,M2
3,ABS,Alcohol Beverage Services,Wholesale Operations,F,90848.00,0.00,5717.68,21
4,ABS,Alcohol Beverage Services,Administration,F,78902.00,205.16,2460.24,18
...,...,...,...,...,...,...,...,...
9953,DOT,Department of Transportation,Transit Nicholson Ride On,M,53239.28,0.00,0.00,15
9954,DOT,Department of Transportation,Transit Nicholson Ride On,M,48162.80,0.00,0.00,15
9955,DOT,Department of Transportation,Transit Nicholson Ride On,M,41971.00,0.00,0.00,15
9956,DOT,Department of Transportation,Transit Nicholson Ride On,M,41971.00,0.00,0.00,15
9957,DOT,Department of Transportation,Transit Nicholson Ride On,F,41971.00,0.00,0.00,15

 Exploratory data analysis

We can check the dimensions of the data with df.shape attribute

In [48]:
dataset.shape

(9958, 8)

We can view the top five and bottom five rows of the dataset with df.head() and df.tail() methods respectively.

In [49]:
dataset.head()

,Department,Department Name,Division,Gender,Base Salary,2020 Overtime Pay,2020 Longevity Pay,Grade
0,ABS,Alcohol Beverage Services,Wholesale Administration,F,78902.0,199.17,0.00,18
1,ABS,Alcohol Beverage Services,Administrative Services,F,35926.0,0.00,4038.91,16
2,ABS,Alcohol Beverage Services,Administration,M,167345.0,0.00,0.00,M2
3,ABS,Alcohol Beverage Services,Wholesale Operations,F,90848.0,0.00,5717.68,21
4,ABS,Alcohol Beverage Services,Administration,F,78902.0,205.16,2460.24,18

In [50]:
dataset.tail()

,Department,Department Name,Division,Gender,Base Salary,2020 Overtime Pay,2020 Longevity Pay,Grade
9953,DOT,Department of Transportation,Transit Nicholson Ride On,M,53239.28,0.0,0.0,15
9954,DOT,Department of Transportation,Transit Nicholson Ride On,M,48162.80,0.0,0.0,15
9955,DOT,Department of Transportation,Transit Nicholson Ride On,M,41971.00,0.0,0.0,15
9956,DOT,Department of Transportation,Transit Nicholson Ride On,M,41971.00,0.0,0.0,15
9957,DOT,Department of Transportation,Transit Nicholson Ride On,F,41971.00,0.0,0.0,15

We can get a concise summary of the dataset with df.info() method. This method prints information about a DataFrame including the index dtype and column dtypes, non-null values and memory usage

In [51]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9958 entries, 0 to 9957
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Department          9958 non-null   object
 1   Department Name     9958 non-null   object
 2   Division            9958 non-null   object
 3   Gender              9958 non-null   object
 4   Base Salary         9958 non-null   float64
 5   2020 Overtime Pay   9958 non-null   float64
 6   2020 Longevity Pay  9958 non-null   float64
 7   Grade               9958 non-null   object
dtypes: float64(3), object(5)
memory usage: 622.5+ KB

We can check the data types of each column in the dataframe with df.dtypes attribute. The above command returns the data type of each column.

In [34]:
dataset.dtypes

iso3                      object
countryname               object
ChangeInFoodBasketCost    object
dtype: object

In [31]:
dataset.columns

Index(['iso3', 'countryname', 'ChangeInFoodBasketCost'], dtype='object')

In [32]:
dataset.describe()

                 iso3    countryname ChangeInFoodBasketCost
count              64             64                     34
unique             64             64                     21
top     #country+code  #country+name                   0.05
freq                1              1                      4

In [6]:
dataset["countryname"] = pd.to_numeric(dataset["iso3"], errors='coerce')

In [7]:
dataset.dtypes

iso3                       object
countryname               float64
ChangeInFoodBasketCost     object
dtype: object

In [10]:
dataset.shape

(64, 3)

In [36]:
dataset["ChangeInFoodBasketCost"] = pd.to_numeric(dataset["ChangeInFoodBasketCost"],errors ='coerce')

In [41]:
dataset["countryname"] = dataset["countryname"].fillna(0.0)

In [42]:
dataset["iso3"] = dataset["iso3"].fillna(0.0)

In [43]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   iso3                    64 non-null     object
 1   countryname             64 non-null     object
 2   ChangeInFoodBasketCost  33 non-null     float64
dtypes: float64(1), object(2)
memory usage: 1.6+ KB

In [52]:
print(dataset.head().to_markdown())

|    | Department   | Department Name           | Division                 | Gender   |   Base Salary |   2020 Overtime Pay |   2020 Longevity Pay | Grade   |
|---:|:-------------|:--------------------------|:-------------------------|:---------|--------------:|--------------------:|---------------------:|:--------|
|  0 | ABS          | Alcohol Beverage Services | Wholesale Administration | F        |         78902 |              199.17 |                 0    | 18      |
|  1 | ABS          | Alcohol Beverage Services | Administrative Services  | F        |         35926 |                0    |              4038.91 | 16      |
|  2 | ABS          | Alcohol Beverage Services | Administration           | M        |        167345 |                0    |                 0    | M2      |
|  3 | ABS          | Alcohol Beverage Services | Wholesale Operations     | F        |         90848 |                0    |              5717.68 | 21      |
|  4 | ABS          | Alcohol Beverage Services | Administration           | F        |         78902 |              205.16 |              2460.24 | 18      |

In [9]:
dataset.tail()

   iso3  countryname ChangeInFoodBasketCost
59  URY          NaN                    NaN
60  UZB          NaN                    NaN
61  VEN          NaN                    NaN
62  YEM          NaN                  -0.09
63  ZMB          NaN                  -0.01